### Terraform Plan (prod.tfvars)
```
random_integer.eks_postfix: Refreshing state... [id=120]
data.aws_caller_identity.current: Reading...
module.ecr[0].aws_ecr_repository.frontend: Refreshing state... [id=ce-prj-prd-frontend-ecr]
module.ecr[0].aws_ecr_repository.backend: Refreshing state... [id=ce-prj-prd-backend-ecr]
module.route53[0].aws_route53_zone.primary: Refreshing state... [id=Z0854174EVLW2648CESN]
data.aws_secretsmanager_secret.codebuild[0]: Reading...
module.vpc[0].module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-05152faae34ddd575]
data.aws_caller_identity.current: Read complete after 1s [id=980921750296]
data.aws_secretsmanager_secret.codebuild[0]: Read complete after 1s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9]
data.aws_secretsmanager_secret_version.codebuild_version[0]: Reading...
data.aws_secretsmanager_secret_version.codebuild_version[0]: Read complete after 0s [id=arn:aws:secretsmanager:eu-central-1:980921750296:secret:github_pat-wYz5N9|AWSCURRENT]
module.vpc[0].module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-03394c70970e99d1a]
module.vpc[0].aws_security_group.vpc_endpoints: Refreshing state... [id=sg-0e97401c4ea4c87a6]
module.vpc[0].module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0c2e127f90d97e562]
module.vpc[0].module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0b3d462ce7c06917f]
module.vpc[0].module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04b1fb47c1c56ad5c]
module.vpc[0].module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c2bea1e8bb03fe41]
module.vpc[0].module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-04a4e4b0f22c879d0]
module.vpc[0].module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-01c2ac5dd564851ce]
module.vpc[0].module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-085845cf07784329c]
module.vpc[0].module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0db15d9bab14afe7d]
module.vpc[0].module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0813a4dfbfcbd4cfd]
module.vpc[0].module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0bab7aa992b867c27]
module.vpc[0].aws_security_group_rule.allow_vpc_to_vpc_endpoints: Refreshing state... [id=sgrule-274929516]
module.vpc[0].module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0db15d9bab14afe7d1080289494]
module.vpc[0].aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0f97a0f00006bc4da]
module.vpc[0].module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-06151d7febd15d69f]
module.vpc[0].module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0411d1733d52d1677]
module.vpc[0].module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0da380efffffc6cb4]
module.vpc[0].module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d6634a61881e27d4]
module.vpc[0].aws_vpc_endpoint.kms: Refreshing state... [id=vpce-0d9430781d8a51777]
module.vpc[0].aws_vpc_endpoint.elb: Refreshing state... [id=vpce-07e74784c672b7e64]
module.vpc[0].aws_vpc_endpoint.ecr_dkr: Refreshing state... [id=vpce-0089135923b7dac5c]
module.vpc[0].aws_vpc_endpoint.ec2: Refreshing state... [id=vpce-0ad29e2b44bbd8cd1]
module.vpc[0].aws_vpc_endpoint.eks: Refreshing state... [id=vpce-0070b2c3c30536ccd]
module.vpc[0].aws_vpc_endpoint.ecr_api: Refreshing state... [id=vpce-0b40266525f438037]
module.vpc[0].aws_vpc_endpoint.sts: Refreshing state... [id=vpce-02006aa993962b29a]
module.vpc[0].aws_vpc_endpoint.logs: Refreshing state... [id=vpce-052629efa0745c2cc]
module.codebuild[0].aws_security_group.codebuild_sg: Refreshing state... [id=sg-0246f211ef1f444a0]
module.codebuild[0].aws_iam_role.codebuild_role: Refreshing state... [id=CodeBuildEKSDeployRole]
module.codebuild[0].aws_codebuild_source_credential.github: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:token/github]
module.rds[0].module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.rds[0].module.rds.module.db_instance.data.aws_partition.current: Reading...
module.rds[0].module.rds.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.rds[0].module.rds.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.codebuild[0].aws_iam_role_policy.codebuild_policy: Refreshing state... [id=CodeBuildEKSDeployRole:terraform-2025070210031344430000000a]
module.codebuild[0].aws_codebuild_project.eks_deploy: Refreshing state... [id=arn:aws:codebuild:eu-central-1:980921750296:project/ce-prj-prd-codebuild]
module.codebuild[0].aws_codebuild_webhook.github: Refreshing state... [id=ce-prj-prd-codebuild]
module.eks[0].module.eks.data.aws_partition.current: Reading...
module.eks[0].module.eks.data.aws_caller_identity.current: Reading...
module.eks[0].aws_iam_role.eks_node_group_role: Refreshing state... [id=ce-task-eks-node-group-role]
module.eks[0].module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/ce-prj-prd-eks-cluster-120/cluster]
module.eks[0].module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks[0].module.eks.aws_iam_role.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250702100944930100000003]
module.eks[0].module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c173ff51a74456bc]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role.this[0]: Refreshing state... [id=example-node-group-20250702100944927900000001]
module.eks[0].module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-088984a9837a06592]
module.eks[0].module.eks.data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.data.aws_iam_session_context.current: Reading...
module.eks[0].module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:iam::980921750296:user/Atakan]
module.eks[0].aws_iam_role_policy_attachment.eks_node_group_cni_policy: Refreshing state... [id=ce-task-eks-node-group-role-20250702100945584200000006]
module.eks[0].aws_iam_role_policy_attachment.eks_node_ecr_readonly: Refreshing state... [id=ce-task-eks-node-group-role-20250702100945604600000007]
module.eks[0].aws_iam_role_policy_attachment.eks_node_s3_readonly: Refreshing state... [id=ce-task-eks-node-group-role-20250702115057362700000004]
module.eks[0].aws_iam_role_policy_attachment.eks_node_group_worker_policy: Refreshing state... [id=ce-task-eks-node-group-role-20250702100945646500000008]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-3292033653]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-882415558]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-1307806651]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2428974121]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-505817538]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-205403793]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2694398398]
module.eks[0].module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-1018422923]
module.eks[0].module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=980921750296]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1667608034]
module.eks[0].module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-3613675092]
module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250702100944930100000003-20250702114502375800000002]
module.eks[0].module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250702100944930100000003-20250702114502377600000003]
module.eks[0].module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1357254717]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=example-node-group-20250702100944927900000001-20250702115057312600000001]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=example-node-group-20250702100944927900000001-20250702115057341200000002]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=example-node-group-20250702100944927900000001-20250702115057349400000003]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_iam_instance_profile.this[0]: Refreshing state... [id=example-node-group-20250702100945505500000005]
module.eks[0].module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks[0].module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1190235165]
module.eks[0].module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=978a3b03-3aba-49da-8d5d-533d3e487cd6]
module.eks[0].module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/ce-prj-prd-eks-cluster-120]
module.eks[0].module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::980921750296:policy/ce-prj-prd-eks-cluster-120-cluster-ClusterEncryption2025070210101052560000000e]
module.eks[0].module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120]
module.eks[0].module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120-cluster-20250702100944930100000003-2025070210101095890000000f]
module.eks[0].module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:user/Atakan]
module.eks[0].module.eks.aws_eks_access_entry.this["codebuild"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole]
module.eks[0].module.eks.data.tls_certificate.this[0]: Reading...
module.eks[0].module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks[0].module.eks.time_sleep.this[0]: Refreshing state... [id=2025-07-02T10:20:13Z]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_eks_access_entry.this[0]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:arn:aws:iam::980921750296:role/example-node-group-20250702100944927900000001]
module.eks[0].module.eks.module.self_managed_node_group["example"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1527950992484354913]
module.eks[0].module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks[0].module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120:vpc-cni]
module.eks[0].module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=efc5619605e4300447be4c860675ff76c35033c7]
module.eks[0].module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED]
module.eks[0].module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120#arn:aws:iam::980921750296:user/Atakan#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks[0].module.eks.aws_eks_access_policy_association.this["codebuild_deploy"]: Refreshing state... [id=ce-prj-prd-eks-cluster-120#arn:aws:iam::980921750296:role/CodeBuildEKSDeployRole#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminPolicy]
module.eks[0].module.eks.module.self_managed_node_group["example"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.31/amazon-linux-2/recommended/image_id]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_launch_template.this[0]: Refreshing state... [id=lt-000a66dce0f6148f4]
module.eks[0].module.eks.module.self_managed_node_group["example"].aws_autoscaling_group.this[0]: Refreshing state... [id=example-20250702102021414100000013]
module.eks[0].helm_release.codebuild_rbac: Refreshing state... [id=codebuild-rbac]
module.bastion[0].data.aws_ssm_parameter.bastion_public_key: Reading...
data.aws_eks_cluster_auth.this[0]: Reading...
data.aws_eks_cluster_auth.this[0]: Read complete after 0s [id=ce-prj-prd-eks-cluster-120]
module.alb[0].module.aws_lb_controller_role.data.aws_caller_identity.current: Reading...
module.alb[0].module.aws_lb_controller_role.data.aws_partition.current: Reading...
module.alb[0].module.aws_lb_controller_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.bastion[0].data.aws_ssm_parameter.bastion_public_key: Read complete after 0s [id=/bastion/public-key]
module.alb[0].module.aws_lb_controller_role.data.aws_caller_identity.current: Read complete after 0s [id=980921750296]
module.alb[0].module.aws_lb_controller_role.data.aws_iam_policy_document.assume_role_with_oidc[0]: Reading...
module.alb[0].module.aws_lb_controller_role.data.aws_iam_policy_document.assume_role_with_oidc[0]: Read complete after 0s [id=2288090653]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.alb[0].aws_iam_policy.aws_lb_controller_policy will be created
  + resource "aws_iam_policy" "aws_lb_controller_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSLoadBalancerControllerIAMPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "ec2:GetSecurityGroupsForVpc",
                          + "ec2:DescribeIpamPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                          + "elasticloadbalancing:DescribeCapacityReservation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:ModifyListenerAttributes",
                          + "elasticloadbalancing:ModifyCapacityReservation",
                          + "elasticloadbalancing:ModifyIpPools",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:SetRulePriorities",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DeleteNetworkInterface",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.alb[0].helm_release.aws_load_balancer_controller will be created
  + resource "helm_release" "aws_load_balancer_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + upgrade_install            = true
      + verify                     = false
      + version                    = "1.10.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "ce-prj-prd-eks-cluster-120"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "image.tag"
          + value = "v2.12.0"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "ingressClass"
          + value = "alb"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-central-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "replicaCount"
          + value = "1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = "arn:aws:iam::980921750296:role/ce-prj-aws-lb-controller-role"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-05152faae34ddd575"
            # (1 unchanged attribute hidden)
        }
    }

  # module.alb[0].kubernetes_service_account.aws_load_balancer_controller will be created
  + resource "kubernetes_service_account" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.bastion[0].aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-045dbe03c5652f049"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ce-prj-prd-bastion-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-085845cf07784329c"
      + tags                                 = {
          + "Name" = "ce-prj-prd-bastion"
        }
      + tags_all                             = {
          + "Name" = "ce-prj-prd-bastion"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.bastion[0].aws_key_pair.ce_task_key will be created
  + resource "aws_key_pair" "ce_task_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ce-prj-prd-bastion-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags_all        = (known after apply)
    }

  # module.bastion[0].aws_security_group.bastion_sg will be created
  + resource "aws_security_group" "bastion_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ce-prj-prd-bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05152faae34ddd575"
    }

  # module.bastion[0].aws_security_group_rule.allow_ssh will be created
  + resource "aws_security_group_rule" "allow_ssh" {
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-088984a9837a06592"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.cloudwatch[0].aws_cloudwatch_log_group.backend will be created
  + resource "aws_cloudwatch_log_group" "backend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/eks/ce-prj-prd/backend"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
      + tags_all          = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
    }

  # module.cloudwatch[0].aws_cloudwatch_log_group.container_insights_performance will be created
  + resource "aws_cloudwatch_log_group" "container_insights_performance" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/containerinsights/ce-prj-prd-eks-cluster-120/performance"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
      + tags_all          = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
    }

  # module.cloudwatch[0].aws_cloudwatch_log_group.frontend will be created
  + resource "aws_cloudwatch_log_group" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/eks/ce-prj-prd/frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
      + tags_all          = {
          + "Environment" = "prd"
          + "Project"     = "ce-prj"
        }
    }

  # module.cloudwatch[0].aws_eks_addon.cloudwatch_container_insights will be created
  + resource "aws_eks_addon" "cloudwatch_container_insights" {
      + addon_name           = "amazon-cloudwatch-observability"
      + addon_version        = "v3.6.0-eksbuild.2"
      + arn                  = (known after apply)
      + cluster_name         = "ce-prj-prd-eks-cluster-120"
      + configuration_values = jsonencode(
            {
              + agent = {
                  + config    = {
                      + logs    = {
                          + metrics_collected = {
                              + kubernetes = {
                                  + cluster_name     = "ce-prj-prd-eks-cluster-120"
                                  + namespace_filter = {
                                      + include = [
                                          + "default",
                                        ]
                                    }
                                }
                            }
                        }
                      + metrics = {
                          + metrics_collected = {
                              + kubernetes = {
                                  + cluster_name                = "ce-prj-prd-eks-cluster-120"
                                  + measurement                 = [
                                      + "pod_cpu_utilization",
                                      + "pod_memory_utilization",
                                    ]
                                  + metrics_collection_interval = 60
                                  + namespace_filter            = {
                                      + include = [
                                          + "default",
                                        ]
                                    }
                                }
                            }
                        }
                    }
                  + resources = {
                      + limits   = {
                          + cpu    = "60m"
                          + memory = "100Mi"
                        }
                      + requests = {
                          + cpu    = "30m"
                          + memory = "50Mi"
                        }
                    }
                }
            }
        )
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.cloudwatch[0].aws_eks_addon.pod_identity will be created
  + resource "aws_eks_addon" "pod_identity" {
      + addon_name           = "eks-pod-identity-agent"
      + addon_version        = "v1.0.0-eksbuild.1"
      + arn                  = (known after apply)
      + cluster_name         = "ce-prj-prd-eks-cluster-120"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.cloudwatch[0].aws_eks_pod_identity_association.cloudwatch_observability will be created
  + resource "aws_eks_pod_identity_association" "cloudwatch_observability" {
      + association_arn = (known after apply)
      + association_id  = (known after apply)
      + cluster_name    = "ce-prj-prd-eks-cluster-120"
      + id              = (known after apply)
      + namespace       = "amazon-cloudwatch"
      + role_arn        = (known after apply)
      + service_account = "cloudwatch-agent"
      + tags_all        = {}
    }

  # module.cloudwatch[0].aws_iam_role.cloudwatch_observability will be created
  + resource "aws_iam_role" "cloudwatch_observability" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRole",
                          + "sts:TagSession",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-prd-cloudwatch-observability-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cloudwatch[0].aws_iam_role_policy.cloudwatch_observability_permissions will be created
  + resource "aws_iam_role_policy" "cloudwatch_observability_permissions" {
      + id          = (known after apply)
      + name        = "ce-prj-prd-cloudwatch-observability-permissions"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeTags",
                          + "ec2:DescribeVolumes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cluster_autoscaler[0].aws_iam_policy.cluster_autoscaler will be created
  + resource "aws_iam_policy" "cluster_autoscaler" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for EKS Cluster Autoscaler"
      + id               = (known after apply)
      + name             = "ce-prj-prd-eks-cluster-120-ClusterAutoscalerPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "autoscaling:DescribeAutoScalingGroups",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:SetDesiredCapacity",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.cluster_autoscaler[0].aws_iam_role.cluster_autoscaler will be created
  + resource "aws_iam_role" "cluster_autoscaler" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED:sub" = "system:serviceaccount:kube-system:cluster-autoscaler"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-prd-eks-cluster-120-ClusterAutoscalerRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cluster_autoscaler[0].aws_iam_role_policy_attachment.cluster_autoscaler will be created
  + resource "aws_iam_role_policy_attachment" "cluster_autoscaler" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ce-prj-prd-eks-cluster-120-ClusterAutoscalerRole"
    }

  # module.cluster_autoscaler[0].helm_release.cluster_autoscaler will be created
  + resource "helm_release" "cluster_autoscaler" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.46.6"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "ce-prj-prd-eks-cluster-120"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "awsRegion"
          + value = "eu-central-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.expander"
          + value = "least-waste"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.logtostderr"
          + value = "true"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-delay-after-add"
          + value = "2m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.scale-down-unneeded-time"
          + value = "2m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-local-storage"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.stderrthreshold"
          + value = "info"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "extraArgs.v"
          + value = "2"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "image.tag"
          + value = "v1.31.0"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.create"
          + value = "false"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler"
            # (1 unchanged attribute hidden)
        }
    }

  # module.cluster_autoscaler[0].kubernetes_service_account.aws_load_balancer_controller will be created
  + resource "kubernetes_service_account" "aws_load_balancer_controller" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "cluster-autoscaler"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.ext-dns[0].aws_iam_role.external_dns will be created
  + resource "aws_iam_role" "external_dns" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED:sub" = "system:serviceaccount:kube-system:external-dns"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-prd-external-dns-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.ext-dns[0].aws_iam_role_policy.external_dns_policy will be created
  + resource "aws_iam_role_policy" "external_dns_policy" {
      + id          = (known after apply)
      + name        = "ce-prj-prd-external-dns-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "route53:ChangeResourceRecordSets",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:route53:::hostedzone/Z0854174EVLW2648CESN",
                        ]
                    },
                  + {
                      + Action   = [
                          + "route53:ListHostedZones",
                          + "route53:ListResourceRecordSets",
                          + "route53:ListTagsForResource",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ext-dns[0].helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = false
      + chart                      = "modules/external-dns/helm"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + upgrade_install            = true
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "domainFilter"
          + value = "ce-project-aws.atakanbal.com"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "exludeDomains"
          + value = "prod.ce-project-aws.atakanbal.com"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "region"
          + value = "eu-central-1"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "roleArn"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "txtOwnerId"
          + value = "ce-prj-prd-eks-cluster-120"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "version"
          + value = "0.14.2"
            # (1 unchanged attribute hidden)
        }
    }

  # module.metrics[0].helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ce-prj-prd-metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + upgrade_install            = true
      + verify                     = false
      + version                    = "3.12.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "resources.limits.cpu"
          + value = "100m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.limits.memory"
          + value = "128Mi"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.requests.cpu"
          + value = "50m"
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "resources.requests.memory"
          + value = "64Mi"
            # (1 unchanged attribute hidden)
        }
    }

  # module.rds[0].aws_iam_role.rds_enhanced_monitoring will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-prd-rds-enhanced-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.rds[0].aws_iam_role_policy_attachment.rds_enhanced_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "ce-prj-prd-rds-enhanced-monitoring-role"
    }

  # module.rds[0].aws_kms_alias.rds_key_alias will be created
  + resource "aws_kms_alias" "rds_key_alias" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/ce-prj-prd-rds-encryption-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.rds[0].aws_kms_key.rds_key will be created
  + resource "aws_kms_key" "rds_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "KMS key for RDS encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.rds[0].aws_security_group.backend_sg will be created
  + resource "aws_security_group" "backend_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.1.0/24",
                  + "10.0.2.0/24",
                ]
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ce-prj-prd-backend-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05152faae34ddd575"
    }

  # module.rds[0].aws_security_group.rds_sg will be created
  + resource "aws_security_group" "rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "ce-prj-prd-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-05152faae34ddd575"
    }

  # module.sns[0].aws_cloudwatch_metric_alarm.backend_high_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "backend_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Backend Pods CPU usage is too high"
      + alarm_name                            = "ce-prj-prd-backend-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "ce-prj-prd-eks-cluster-120"
          + "Namespace"   = "default"
          + "PodName"     = "backend"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "pod_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 2
      + treat_missing_data                    = "missing"
    }

  # module.sns[0].aws_cloudwatch_metric_alarm.frontend_high_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "frontend_high_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Frontend Pods CPU usage is too high"
      + alarm_name                            = "ce-prj-prd-frontend-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "ClusterName" = "ce-prj-prd-eks-cluster-120"
          + "Namespace"   = "default"
          + "Podname"     = "frontend"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "pod_cpu_utilization"
      + namespace                             = "ContainerInsights"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.sns[0].aws_sns_topic.alerts will be created
  + resource "aws_sns_topic" "alerts" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "ce-prj-prd-alerts"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.sns[0].aws_sns_topic_subscription.email will be created
  + resource "aws_sns_topic_subscription" "email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "atakannbal@gmail.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.alb[0].module.aws_lb_controller_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::980921750296:oidc-provider/oidc.eks.eu-central-1.amazonaws.com/id/F672F31E95DBB0445F7EB2D9C8AAE7ED"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ce-prj-prd-aws-lb-controller-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)

      + inline_policy (known after apply)
    }

  # module.alb[0].module.aws_lb_controller_role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ce-prj-prd-aws-lb-controller-role"
    }

  # module.rds[0].module.rds.module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = false
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 1
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = "calculator"
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "15"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = "ce-prj-prd-calculator-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password_wo                           = (write-only attribute)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "atakbal"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.rds[0].module.rds.module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "ce-prj-prd-calculator-db parameter group"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "ce-prj-prd-calculator-db-"
      + skip_destroy = false
      + tags         = {
          + "Name" = "ce-prj-prd-calculator-db"
        }
      + tags_all     = {
          + "Name" = "ce-prj-prd-calculator-db"
        }
    }

  # module.rds[0].module.rds.module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "ce-prj-prd-calculator-db subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "ce-prj-prd-calculator-db-"
      + subnet_ids              = [
          + "subnet-0813a4dfbfcbd4cfd",
          + "subnet-0bab7aa992b867c27",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "ce-prj-prd-calculator-db"
        }
      + tags_all                = {
          + "Name" = "ce-prj-prd-calculator-db"
        }
      + vpc_id                  = (known after apply)
    }

Plan: 39 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ bastion_ssh_command           = "No bastion host available" -> (known after apply)

Warning: Argument is deprecated

  with module.eks[0].module.eks.aws_iam_role.this[0],
  on .terraform/modules/eks.eks/main.tf line 393, in resource "aws_iam_role" "this":
 393: resource "aws_iam_role" "this" {

inline_policy is deprecated. Use the aws_iam_role_policy resource instead. If
Terraform should exclusively manage all inline policy associations (the
current behavior of this argument), use the aws_iam_role_policies_exclusive
resource as well.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
<!-- Sticky Pull Request Comment -->